import DashboardHeader from "@/components/DashboardHeader";
import { auth } from "@/auth";
import connectMongo from "@/libs/mongoose";
import Sub from "@/models/Sub";
import { getSubData } from "@/libs/constants";

const getDaysUntil = (date) => {
  if (!date) return "0 days";
  const diff = new Date(date) - new Date();
  const days = Math.ceil(diff / (1000 * 60 * 60 * 24));
  return days > 0 ? `${days} days` : "today";
};

export default async function Statistic() {
  await connectMongo();
  const session = await auth();

  if (!session) return null;

  // 1. Получаем подписки пользователя
  const subs = await Sub.find({ userId: session.user.id });

  // 2. Предварительно обрабатываем данные каждой подписки через твою функцию getSubData
  const subsWithData = subs.map((sub) => ({
    ...sub.toObject(),
    meta: getSubData(sub), // здесь лежат diffDays и badge (Warning/Upcoming/Active)
  }));

  // Вычисляем общую сумму в месяц
  const totalMonthly = subs.reduce((acc, sub) => {
    let price = Number(sub.price) || 0;
    if (sub.unit === "/y") price = price / 12;
    return acc + price;
  }, 0);

  // Ищем самую дорогую
  const mostExpensiveSub =
    subs.length > 0
      ? subs.reduce((prev, curr) => {
          const getMoPrice = (s) => (s.unit === "/y" ? s.price / 12 : s.price);
          return getMoPrice(prev) > getMoPrice(curr) ? prev : curr;
        })
      : null;

  // Ближайший платеж (используем уже отсортированные данные)
  const upcomingSub = subsWithData
    .filter((s) => s.nextCharge)
    .sort((a, b) => new Date(a.nextCharge) - new Date(b.nextCharge))[0];

  // Определяем стили для карточки ближайшего платежа на основе твоего badge.text
  const getStatusColor = (status) => {
    if (status === "Warning") return "bg-error/10 border border-error/50";
    if (status === "Upcoming") return "bg-warning/10 border border-warning/50";
    return "bg-base-100";
  };

  const statusInfo = upcomingSub?.meta?.badge;

  return (
    <>
      <DashboardHeader />
      <div className="px-5 md:px-10 lg:px-15">
        <div className="max-w-7xl mx-auto">
          <h1 className="mt-11 font-regular text-2xl mb-3">Statistic</h1>
          <div className="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-4 gap-4">
            <div className="relative bg-base-100 rounded-xl p-4">
              <p className="text-xs text-base-content mb-6">
                Next charge -{" "}
                <span className="font-bold">
                  in {getDaysUntil(upcomingSub?.nextCharge)}
                </span>
              </p>
              <p className="text-3xl font-bold text-primary-content">
                ${upcomingSub?.price || "0"}
              </p>
              <div className="absolute bottom-4 right-4 h-10 w-10 flex items-center justify-center rounded-full bg-secondary/10">
                <svg
                  className="w-6 h-6"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M15 11H13V7C13 6.73478 12.8946 6.48043 12.7071 6.29289C12.5196 6.10536 12.2652 6 12 6C11.7348 6 11.4804 6.10536 11.2929 6.29289C11.1054 6.48043 11 6.73478 11 7V12C11 12.2652 11.1054 12.5196 11.2929 12.7071C11.4804 12.8946 11.7348 13 12 13H15C15.2652 13 15.5196 12.8946 15.7071 12.7071C15.8946 12.5196 16 12.2652 16 12C16 11.7348 15.8946 11.4804 15.7071 11.2929C15.5196 11.1054 15.2652 11 15 11ZM12 2C10.0222 2 8.08879 2.58649 6.4443 3.6853C4.79981 4.78412 3.51809 6.3459 2.76121 8.17317C2.00433 10.0004 1.8063 12.0111 2.19215 13.9509C2.578 15.8907 3.53041 17.6725 4.92894 19.0711C6.32746 20.4696 8.10929 21.422 10.0491 21.8079C11.9889 22.1937 13.9996 21.9957 15.8268 21.2388C17.6541 20.4819 19.2159 19.2002 20.3147 17.5557C21.4135 15.9112 22 13.9778 22 12C22 10.6868 21.7413 9.38642 21.2388 8.17317C20.7363 6.95991 19.9997 5.85752 19.0711 4.92893C18.1425 4.00035 17.0401 3.26375 15.8268 2.7612C14.6136 2.25866 13.3132 2 12 2ZM12 20C10.4178 20 8.87104 19.5308 7.55544 18.6518C6.23985 17.7727 5.21447 16.5233 4.60897 15.0615C4.00347 13.5997 3.84504 11.9911 4.15372 10.4393C4.4624 8.88743 5.22433 7.46197 6.34315 6.34315C7.46197 5.22433 8.88743 4.4624 10.4393 4.15372C11.9911 3.84504 13.5997 4.00346 15.0615 4.60896C16.5233 5.21447 17.7727 6.23984 18.6518 7.55544C19.5308 8.87103 20 10.4177 20 12C20 14.1217 19.1572 16.1566 17.6569 17.6569C16.1566 19.1571 14.1217 20 12 20Z"
                    className="fill-secondary"
                  />
                </svg>
              </div>
            </div>

            <div className="relative bg-base-100 rounded-xl p-4">
              <p className="text-xs text-base-content mb-6">
                Active subscriptions
              </p>
              <p className="text-3xl font-bold text-primary-content">
                {subs.length}
              </p>
              <div className="absolute bottom-4 right-4 h-10 w-10 flex items-center justify-center rounded-full bg-success/10">
                <svg
                  className="w-6 h-6"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M18.7099 7.20986C18.617 7.11613 18.5064 7.04174 18.3845 6.99097C18.2627 6.9402 18.132 6.91406 17.9999 6.91406C17.8679 6.91406 17.7372 6.9402 17.6154 6.99097C17.4935 7.04174 17.3829 7.11613 17.29 7.20986L9.83995 14.6699L6.70995 11.5299C6.61343 11.4366 6.49949 11.3633 6.37463 11.3141C6.24978 11.2649 6.11645 11.2408 5.98227 11.2431C5.84809 11.2454 5.71568 11.2741 5.5926 11.3276C5.46953 11.3811 5.35819 11.4583 5.26495 11.5549C5.17171 11.6514 5.0984 11.7653 5.04919 11.8902C4.99999 12.015 4.97586 12.1484 4.97818 12.2825C4.9805 12.4167 5.00923 12.5491 5.06272 12.6722C5.11622 12.7953 5.19343 12.9066 5.28995 12.9999L9.12995 16.8399C9.22291 16.9336 9.33351 17.008 9.45537 17.0588C9.57723 17.1095 9.70794 17.1357 9.83995 17.1357C9.97196 17.1357 10.1027 17.1095 10.2245 17.0588C10.3464 17.008 10.457 16.9336 10.55 16.8399L18.7099 8.67986C18.8115 8.58622 18.8925 8.47257 18.9479 8.34607C19.0033 8.21957 19.0319 8.08296 19.0319 7.94486C19.0319 7.80676 19.0033 7.67015 18.9479 7.54365C18.8925 7.41715 18.8115 7.3035 18.7099 7.20986Z"
                    className="fill-success"
                  />
                </svg>
              </div>
            </div>

            {/* Хочу / On progress — warning */}
            <div className="relative bg-base-100 rounded-xl p-4">
              <p className="text-xs text-base-content mb-6">
                You spend in total
              </p>
              <p className="text-3xl font-bold text-primary-content">
                ${totalMonthly.toFixed(2)}
                <span className="font-normal text-[12px]">/mo</span>
              </p>
              <div className="absolute bottom-4 right-4 h-10 w-10 flex items-center justify-center rounded-full bg-warning/10">
                <svg
                  className="w-6 h-6"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M19.8901 9.55029C19.807 9.38537 19.6799 9.24669 19.5228 9.14961C19.3657 9.05253 19.1848 9.00085 19.0001 9.00029H14.0001V3.00029C14.0108 2.78097 13.9491 2.56422 13.8244 2.38349C13.6997 2.20276 13.519 2.06809 13.3101 2.00029C13.1093 1.93423 12.8928 1.93349 12.6916 1.99817C12.4903 2.06285 12.3148 2.18962 12.1901 2.36029L4.19011 13.3603C4.08987 13.5052 4.02968 13.6739 4.01564 13.8495C4.00159 14.0251 4.03418 14.2013 4.11011 14.3603C4.18003 14.542 4.30149 14.6994 4.4596 14.8131C4.6177 14.9268 4.80555 14.9919 5.00011 15.0003H10.0001V21.0003C10.0003 21.2112 10.0671 21.4166 10.191 21.5872C10.3149 21.7578 10.4896 21.8849 10.6901 21.9503C10.7906 21.9814 10.8949 21.9983 11.0001 22.0003C11.1579 22.0007 11.3135 21.9638 11.4543 21.8925C11.5951 21.8212 11.717 21.7177 11.8101 21.5903L19.8101 10.5903C19.9178 10.4411 19.9823 10.265 19.9964 10.0815C20.0106 9.89805 19.9738 9.71421 19.8901 9.55029ZM12.0001 17.9203V14.0003C12.0001 13.7351 11.8947 13.4807 11.7072 13.2932C11.5197 13.1056 11.2653 13.0003 11.0001 13.0003H7.00011L12.0001 6.08029V10.0003C12.0001 10.2655 12.1055 10.5199 12.293 10.7074C12.4805 10.8949 12.7349 11.0003 13.0001 11.0003H17.0001L12.0001 17.9203Z"
                    className="fill-warning"
                  />
                </svg>
              </div>
            </div>

            <div className="relative bg-base-100 rounded-xl p-4">
              <p className="text-xs text-base-content mb-6">Most expensive</p>
              <p className="text-3xl font-bold text-primary-content">
                ${mostExpensiveSub?.price || "0"}
                <span className="font-normal text-[12px]">
                  {mostExpensiveSub?.unit}
                </span>
              </p>
              <div className="absolute bottom-4 right-4 h-10 w-10 flex items-center justify-center rounded-full bg-accent/10">
                <svg
                  className="w-6 h-6"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M8.4678 8.3947L8.46555 8.39653L8.46341 8.39861L8.4678 8.3947ZM18.4219 8.20817C18.3523 8.14111 18.2751 8.08244 18.1919 8.03336C18.0741 7.96402 17.9433 7.91958 17.8076 7.9028C17.672 7.88601 17.5343 7.89723 17.4031 7.93577C17.272 7.9743 17.1501 8.03933 17.0451 8.12683C16.9401 8.21433 16.8541 8.32245 16.7925 8.4445C16.448 9.12319 15.9729 9.72718 15.3945 10.2218C15.483 9.72344 15.5276 9.21825 15.5278 8.71207C15.5297 7.17217 15.1234 5.65928 14.3505 4.32743C13.5775 2.99558 12.4654 1.89235 11.1274 1.13007C10.98 1.04651 10.8138 1.00178 10.6444 1.00005C10.475 0.998327 10.3079 1.03967 10.1588 1.12021C10.0098 1.20074 9.88362 1.31783 9.7922 1.46048C9.70078 1.60313 9.6471 1.76666 9.6362 1.93574C9.58024 2.88391 9.33236 3.81085 8.90759 4.6604C8.48282 5.50995 7.88999 6.26442 7.16503 6.8781L6.93456 7.0656C6.17648 7.57569 5.50546 8.2045 4.94726 8.9279C4.07958 10.021 3.47851 11.3012 3.19172 12.6671C2.90493 14.0329 2.94031 15.4468 3.29506 16.7966C3.6498 18.1464 4.31415 19.3949 5.23543 20.4433C6.1567 21.4916 7.30956 22.3109 8.60257 22.8361C8.75439 22.8981 8.91914 22.9219 9.08229 22.9052C9.24545 22.8885 9.40198 22.8319 9.5381 22.7404C9.67422 22.6489 9.78573 22.5254 9.8628 22.3806C9.93987 22.2358 9.98013 22.0743 9.98003 21.9103C9.97932 21.8042 9.96252 21.6989 9.93023 21.5978C9.7065 20.7568 9.64208 19.8814 9.74028 19.0168C10.6865 20.8015 12.2054 22.2162 14.0528 23.0334C14.2783 23.1342 14.5332 23.1478 14.7681 23.0715C16.2277 22.6004 17.5425 21.7639 18.5878 20.6415C19.633 19.5191 20.3739 18.1481 20.74 16.6588C21.1061 15.1694 21.0853 13.6112 20.6796 12.1321C20.2739 10.653 19.4967 9.30227 18.4219 8.20817ZM14.5171 21.0392C13.6454 20.5975 12.8765 19.9772 12.2603 19.2187C11.6441 18.4602 11.1944 17.5806 10.9405 16.6369C10.8629 16.3191 10.8029 15.9974 10.7608 15.673C10.7322 15.4665 10.6398 15.274 10.4965 15.1226C10.3532 14.9711 10.1661 14.8682 9.96146 14.8283C9.89841 14.8159 9.8343 14.8096 9.77003 14.8097C9.59427 14.8097 9.42161 14.856 9.26944 14.9439C9.11728 15.0319 8.991 15.1584 8.90333 15.3107C8.0736 16.7419 7.65633 18.3748 7.69776 20.0285C6.968 19.4611 6.35811 18.7545 5.90344 17.9497C5.44876 17.1449 5.15835 16.2578 5.04903 15.3399C4.93971 14.422 5.01366 13.4915 5.26658 12.6024C5.51951 11.7133 5.94639 10.8833 6.52247 10.1603C6.95989 9.59218 7.48756 9.09964 8.08447 8.70235C8.11032 8.68567 8.1351 8.6674 8.15869 8.64766C8.15869 8.64766 8.45538 8.40218 8.46552 8.39656C9.89022 7.19152 10.9035 5.57207 11.3643 3.76387C12.4538 4.7711 13.1804 6.1099 13.431 7.57238C13.6817 9.03485 13.4425 10.5392 12.7505 11.8518C12.6591 12.0269 12.6216 12.2252 12.6427 12.4216C12.6639 12.6181 12.7427 12.8039 12.8693 12.9555C12.9959 13.1072 13.1646 13.218 13.3541 13.2739C13.5436 13.3298 13.7454 13.3284 13.9341 13.2698C15.4659 12.7896 16.8138 11.8517 17.7964 10.5823C18.3869 11.4545 18.773 12.4489 18.9259 13.4911C19.0787 14.5334 18.9944 15.5967 18.6792 16.6018C18.364 17.6069 17.826 18.528 17.1054 19.2963C16.3847 20.0646 15.5 20.6604 14.5171 21.0393L14.5171 21.0392Z"
                    className="fill-accent"
                  />
                </svg>
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}
